// 复制数组
// 利用扩展运算法 实现数组的复制。值得注意的是，扩展运算符 的使用是深拷贝还是浅拷贝得看数据源的数据类型。
// 如果只是一层数组或是对象，其元素只是简单类型的元素，那么属于深拷贝。
let arr = ['张三', '李四', '王五', '找六', '张三']
let test = [...arr] // => 深拷贝
console.log(test) // => ['张三', '李四', '王五', '找六', '张三']
let obj = {
    age: 18,
    name: '小明',
    address: {
        city: '东莞'
    }
}
let newObj = {
    ...obj
}
console.log(newObj.address.city) // => 东莞


// 扩展运算符 还可以将数组转为对象
let arr1 = ['张三', '李四', '王五', '找六', '张三']
let obj1 = {
    ...arr1
}
console.log(obj1) // => {0: '张三', 1: '李四', 2: '王五', 3: '找六', 4: '张三'}